Revit 2026 API

# Rectangle(Rectangle) Constructor

---

Constructs a new copy of the input ScreenRectangle object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Rectangle(
	Rectangle other
)
```
```vb
Public Sub New (
	other As Rectangle
)
```
```cpp
public:
Rectangle(
	Rectangle^ other
)
```
```fsharp
new :
        other : Rectangle -> Rectangle
```

#### Parameters

other Rectangle

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Rectangle Class

Rectangle Overload

Autodesk.Revit.DB Namespace